# Lesson: Let's preprocess the data!

## File I/O and exploring the data

In [1]:
import pandas as pd

f = '../data/census_data.csv'

# read in the file
census = pd.read_csv(f)

# look at the first 5 lines

census.head()

,age,work_class,education,education_num,marital_status,occupation,relationship,race,sex,hours_per_week,native_country,fifty_k
0,47,Private,10th,6,Divorced,Exec-managerial,Not-in-family,Amer-Indian-Eskimo,Female,45,United-States,<=50K
1,40,Private,10th,6,Divorced,Craft-repair,Not-in-family,Amer-Indian-Eskimo,Male,40,United-States,<=50K
2,30,Private,10th,6,Divorced,Other-service,Not-in-family,Amer-Indian-Eskimo,Male,40,United-States,<=50K
3,27,Private,10th,6,Divorced,Transport-moving,Not-in-family,Amer-Indian-Eskimo,Male,75,United-States,<=50K
4,38,Private,10th,6,Divorced,Machine-op-inspct,Not-in-family,Asian-Pac-Islander,Female,40,Portugal,<=50K

In [2]:
# What are the column names?
census.columns

Index(['age', 'work_class', 'education', 'education_num', 'marital_status',
       'occupation', 'relationship', 'race', 'sex', 'hours_per_week',
       'native_country', 'fifty_k'],
      dtype='object')

In [64]:
# Sort the DataFrame by age and print out the last 5 lines
census.sort_values('age').tail()

,age,work_class,education,education_num,marital_status,occupation,relationship,race,sex,hours_per_week,native_country,fifty_k
27276,90,Private,Some-college,10,Never-married,Other-service,Not-in-family,Asian-Pac-Islander,Male,35,United-States,<=50K
1725,90,Private,11th,7,Never-married,Handlers-cleaners,Own-child,White,Male,40,United-States,<=50K
3524,90,Private,9th,5,Never-married,Adm-clerical,Not-in-family,White,Female,40,United-States,<=50K
21269,90,Private,HS-grad,9,Widowed,Transport-moving,Unmarried,White,Male,99,United-States,<=50K
2940,90,Local-gov,7th-8th,4,Married-civ-spouse,Protective-serv,Husband,White,Male,40,United-States,<=50K

## Selecting columns and rows

In [65]:
# create a subset of the data with the columns education, occupation, hours_per_week. Look at the first 5 rows.
cen1= census[['education','occupation','hours_per_week']]
cen1.head()

  education         occupation  hours_per_week
0      10th    Exec-managerial              45
1      10th       Craft-repair              40
2      10th      Other-service              40
3      10th   Transport-moving              75
4      10th  Machine-op-inspct              40

In [25]:
# create a subset of the data with rows 50-100 and the columns work_class and race. Look at the first 5 rows.
#cen2 = census[50:100, ['work_class','race']]

cen2=census.loc[50:100,['work_class','race']].head()

In [36]:
# create a subset of the data where education_num is greater than 8 and where sex is equal to Female. Look at the first 5 rows

cen3=census[(census['education_num'] > 8 ) & (census['sex']=='Female')]
cen3.head()

,age,work_class,education,education_num,marital_status,occupation,relationship,race,sex,hours_per_week,native_country,fifty_k
3697,46,Private,Assoc-acdm,12,Divorced,Tech-support,Not-in-family,Black,Female,36,United-States,<=50K
3698,41,Private,Assoc-acdm,12,Divorced,Exec-managerial,Not-in-family,Black,Female,40,Jamaica,<=50K
3699,44,Federal-gov,Assoc-acdm,12,Divorced,Adm-clerical,Not-in-family,Black,Female,40,United-States,<=50K
3700,57,Private,Assoc-acdm,12,Divorced,Adm-clerical,Not-in-family,Black,Female,40,United-States,<=50K
3701,32,Local-gov,Assoc-acdm,12,Divorced,Exec-managerial,Not-in-family,Black,Female,40,United-States,<=50K

## groupby

In [40]:
# Group by work_class and output the group names (hint: add .keys() to the end of your line of code).
census.groupby('work_class').groups.keys()

dict_keys(['Federal-gov', 'Local-gov', 'Private', 'Self-emp-inc', 'Self-emp-not-inc', 'State-gov', 'Without-pay'])

In [41]:
# Let's group by work_class and use the mean as the aggregate function

census.groupby('work_class').mean()

                        age  education_num  hours_per_week
work_class
Federal-gov       42.577943      10.948038       41.279958
Local-gov         41.743106      11.036768       41.002419
Private           36.794355       9.871085       40.250875
Self-emp-inc      46.027933      11.167598       48.802607
Self-emp-not-inc  45.011605      10.211285       44.432173
State-gov         39.362002      11.349492       39.053948
Without-pay       47.785714       9.071429       32.714286

## Pivoting

In [46]:
# Let's pivot on education_num and sex, with hours_per_week as the values and mean as the aggfunc

census.pivot_table(index=['education_num'],columns='sex',values='hours_per_week',aggfunc='mean')

sex               Female       Male
education_num
1              32.142857  39.000000
2              31.883721  40.962963
3              34.942029  40.013699
4              36.901515  41.134118
5              34.739496  40.193452
6              32.548000  39.621053
7              29.528302  36.750369
8              31.524590  37.694118
9              37.128783  42.847045
10             35.127643  41.985615
11             38.542857  43.775822
12             37.918987  43.288744
13             39.650460  44.373651
14             41.406680  45.531306
15             44.896552  48.549451
16             47.703704  47.867347

In [ ]:
# Create a pivot table of your choosing, with any columns for rows and cols and a numerical columns for values.

census.pivot_table

## Let's do the following:

For the machine learning section, can you extract a subset of the data where:

- `native_country` equals `United-States`
- `hours_per_week` is greater than 10
- `age` is greater than 20 and less than 50
- `education` is `Masters`

It's going to be a bunch of boolean indexing!

In [48]:
# Store that new dataframe in new_df and print out the first five rows.

cenml = census[(census['native_country']=='United-States') & (census['hours_per_week']>10) & (census['age']>20 ) & (census['age']<50 ) & (census['education'] =='Masters' )]

cenml.head()

,age,work_class,education,education_num,marital_status,occupation,relationship,race,sex,hours_per_week,native_country,fifty_k
21271,46,Local-gov,Masters,14,Divorced,Prof-specialty,Not-in-family,Amer-Indian-Eskimo,Male,40,United-States,<=50K
21279,45,Local-gov,Masters,14,Divorced,Prof-specialty,Not-in-family,Black,Male,40,United-States,<=50K
21280,47,Local-gov,Masters,14,Divorced,Protective-serv,Not-in-family,Black,Male,50,United-States,>50K
21281,31,Private,Masters,14,Divorced,Other-service,Not-in-family,Other,Female,30,United-States,<=50K
21285,45,Self-emp-not-inc,Masters,14,Divorced,Prof-specialty,Not-in-family,White,Female,15,United-States,<=50K

In [61]:
# Split the DataFrame so that all of the columns except the last one are in new_df_data, and the last one is in new_df_labels.

new_df_data = cenml.iloc[:,:-1]

new_df_data.head()

cenml.shape

new_df_data.shape

new_df_labels = cenml.iloc[:,-1]

new_df_labels.head()

new_df_labels.shape

(1052,)

# For those using IPython Notebook/Wakari/NBViewer: Go to the [scikit_learn](scikit_learn.ipynb) notebook!

(For those using code files, please go to scikit_learn_materials.py!)

###End of Pandas section.

# Lesson: let's classify our data!

## Final preprocessing touches

Scikit-learn estimators take in continuous data only, which means that we'll have to transform our categorical data into something the scikit-learn estimators can handle. This is actually much easier than it sounds! We're going to convert our dataframe into a dictionary, and then encode the data in that dictionary into arrays of 1s and 0s.

Let's first transform the `DataFrame` into a dictionary. We first have to transpose our `DataFrame`, so there is one row per nested dictionary. Finally, we'll put each item into a list, because scikit-learn's `DictVectorizer` object takes a list of dictionaries to encode. We also only need the values from our list of dictionaries.

In [67]:
new_df_transpose = new_df_data.transpose()

data_into_dict = new_df_transpose.to_dict()
census_data = [v for k, v in data_into_dict.items()]

Now, let's encode those features and instances.

In [68]:
from sklearn.feature_extraction import DictVectorizer

dv = DictVectorizer()
transformed_data = dv.fit_transform(census_data).toarray()
transformed_data

array([[46.,  1., 14., ...,  0.,  0.,  0.],
       [45.,  1., 14., ...,  0.,  0.,  0.],
       [47.,  1., 14., ...,  0.,  0.,  0.],
       ...,
       [49.,  1., 14., ...,  0.,  0.,  0.],
       [46.,  1., 14., ...,  0.,  0.,  1.],
       [43.,  1., 14., ...,  0.,  0.,  0.]])

Now that we've done that, let's encode the labels.

In [69]:
from sklearn.preprocessing import LabelEncoder

le = LabelEncoder()
transformed_labels = le.fit_transform(new_df_labels)
transformed_labels

array([0, 0, 1, ..., 0, 0, 1])

Now that we've done that, can you separate the `transformed_data` and `transformed_labels` into training and test sets?

In [72]:
from sklearn.model_selection import train_test_split

trancen_data_train,trancen_data_test,trancen_lab_train,trancen_lab_test=train_test_split(transformed_data,transformed_labels)

Let's fit and predict all three classifiers to this data.

In [77]:
from sklearn.neighbors import KNeighborsClassifier
from sklearn.tree import DecisionTreeClassifier
from sklearn.naive_bayes import GaussianNB

# fit all

knn_cen = KNeighborsClassifier()
knn_cen.fit(trancen_data_train,trancen_lab_train)

dt_cen = DecisionTreeClassifier()
dt_cen.fit(trancen_data_train,trancen_lab_train)

nb_cen = GaussianNB()
nb_cen.fit(trancen_data_train,trancen_lab_train)

# predict all
knn_pred = knn_cen.predict(trancen_data_test)
dt_pred = dt_cen.predict(trancen_data_test)
nb_pred=nb_cen.predict(trancen_data_test)

# Output kNN predictions on first 10 labels

knn_pred[:10]

array([1, 0, 1, 1, 0, 0, 1, 0, 0, 1])

In [78]:
# Output decision tree predictions on first 10 labels
dt_pred[:10]

array([1, 0, 0, 1, 0, 0, 1, 0, 1, 1])

In [79]:
# Output NB predictions on first 10 labels
nb_pred[:10]

array([1, 0, 0, 0, 0, 0, 0, 0, 0, 1])

Let's cross validate each.

In [82]:
# Run cross-validation on kNN. Set cv=5
from sklearn.model_selection import cross_val_score

cross_val_score(knn_cen,transformed_data,transformed_labels,cv=5)

array([0.61792453, 0.60952381, 0.61904762, 0.48571429, 0.6047619 ])

In [83]:
# Run cross-validation on NB. Set cv=5
cross_val_score(nb_cen,transformed_data,transformed_labels,cv=5)

array([0.71226415, 0.57619048, 0.5952381 , 0.53333333, 0.66190476])

In [84]:
cross_val_score(dt_cen,transformed_data,transformed_labels,cv=5)

array([0.66509434, 0.57619048, 0.6047619 , 0.36666667, 0.49047619])

# For those using IPython Notebook/Wakari/NBViewer: Go to the [matplotlib](matplotlib.ipynb) notebook!

(For those using code files, please go to matplotlib_materials.py!)

### End of scikit-learn section.

# Lesson: what can plots tell us about our data and results?

In [ ]:
# Let's look at the distribution of classes in our dataset. Can you get the value_counts of new_df_labels and make a bar chart?
%matplotlib inline
import matplotlib.pyplot as plt

In [ ]:
# Now, can you make a bar chart comparing the predicted kNN labels to the actual labels? You can use the first 10 only if you want.

In [ ]:
# What other visualizations would be helpful? Can you come up with a few more?